:PROPERTIES:
:ID:       c1fcba1a-6c3c-48cb-ac81-8f89f42650ab
:END:
#+title: rust collections
#+filetags: :notes:


* Vectors
Vectors can be initialized either using the ~Vec::new()~ constructor or ~vec!~ macro.
#+begin_src rust
let mut v1: Vec<i32> = Vec::new();

v1.push(1);
v1.push(2);
v1.push(3);
v1.push(4);

println!("v1: {:?}", v1);

let v2 = vec![1, 2, 3];

println!("v2: {:?}", v2);
#+end_src

#+RESULTS:
: v1: [1, 2, 3]
: v2: [1, 2, 3]



Vector elements can be accessed using ~[]~ operator or ~.get()~ method.

#+begin_src rust
let v = vec![1, 2, 3, 4, 5];

let first = &v[0];
let second = v.get(1);

#+end_src


* Strings

#+begin_src rust




#+end_src


#+begin_src latex

\label{sdd}

\begin{document}
\end{document}
#+end_src

#+RESULTS:
#+begin_export latex
#+end_export

* test

